system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    ( -1.3   -4.0    0 )    // vertex number 0
    (  1.2   -4.0    0 )    // vertex number 1
    (  1.2    4.0    0 )    // vertex number 2
    ( -1.3    4.0    0 )    // vertex number 3

    ( -1.00  -4.0    5 )    // vertex number 4
    (  0.15  -4.0    5 )    // vertex number 5
    (  0.15   4.0    5 )    // vertex number 6
    ( -1.00   4.0    5 )    // vertex number 7

    ( -1.00  -4.0   15 )    // vertex number 8
    (  0.15  -4.0   15 )    // vertex number 9
    (  0.15   4.0   15 )    // vertex number 10
    ( -1.00   4.0   15 )    // vertex number 11

    ( -15   -4.0     0 )    // vertex number 12
    ( -15    4.0     0 )    // vertex number 13
    ( -15   -4.0     5 )    // vertex number 14
    ( -15    4.0     5 )    // vertex number 15
    ( -15  -4.0     15 )    // vertex number 16
    ( -15   4.0     15 )    // vertex number 17

    (  15   -4.0     0 )    // vertex number 18
    (  15    4.0     0 )    // vertex number 19
    (  15   -4.0     5 )    // vertex number 20
    (  15    4.0     5 )    // vertex number 21
    (  15   -4.0    15 )    // vertex number 22
    (  15    4.0    15 )    // vertex number 23

);

blocks
(
    // wing
    hex (  0  1  2  3  4  5  6  7 ) ( 20 20 20 )  simpleGrading ( 
        ( (0.5 0.5    3) (0.5 0.5 0.3333) )  
        ( (0.5 0.5 0.05) (0.5 0.5     20) )
        0.2  
    ) 

    // Winglet extension
    hex (  4  5  6  7  8  9 10 11 ) ( 20 20 20 )  simpleGrading (
        ( (0.5 0.5    3) (0.5 0.5 0.3333) )    
        ( (0.5 0.5 0.05) (0.5 0.5     20) ) 
        5
    ) 
    
    hex ( 12  0  3 13 14  4  7 15 ) ( 15 20 20 )  simpleGrading (0.05  ( (0.5 0.5 0.05) (0.5 0.5 20) ) 0.2  ) // front wing
    hex ( 14  4  7 15 16  8 11 17 ) ( 15 20 20 )  simpleGrading (0.05  ( (0.5 0.5 0.05) (0.5 0.5 20) ) 5    ) // front winglet
    hex (  1 18 19  2  5 20 21  6 ) ( 15 20 20 )  simpleGrading (20    ( (0.5 0.5 0.05) (0.5 0.5 20) ) 0.2  ) // back  wing
    hex (  5 20 21  6  9 22 23 10 ) ( 15 20 20 )  simpleGrading (20    ( (0.5 0.5 0.05) (0.5 0.5 20) ) 5    ) // back  winglet

);

boundary
(
    left
    {
        type  symmetry;
        faces
        (
            (0 3 2 1)
            (1 2 19 18)
            (12 13 3 0)
        );
    }

    freestream
    {
        type patch;
        faces
        (
            (  3  7  6  2 )
            (  2  6 21 19 )
            ( 13 15  7  3 )
            ( 15 17 11  7 )
            ( 11 10  6  7 )
            ( 10 23 21  6 )
            ( 16  8 11 17 )
            (  8  9 10 11 )
            (  9 22 23 10 )
            ( 22 20 21 23 )
            ( 20 18 19 21 )
            ( 12 14 15 13 )
            ( 14 16 17 15 )
            (  0  1  5  4 )
            (  5  9  8  4 )
            (  4  8 16 14 )
            (  0  4 14 12 )
            ( 18 20  1  5 )
            ( 20 22  9  5 )
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
