system/blockMeshDict_2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    ( -15   -4.0    0 )    // vertex number 0
    (  15   -4.0    0 )    // vertex number 1
    (  15    4.0    0 )    // vertex number 2
    ( -15    4.0    0 )    // vertex number 3

    ( -15  -4.0    15 )    // vertex number 4
    (  15  -4.0    15 )    // vertex number 5
    (  15   4.0    15 )    // vertex number 6
    ( -15   4.0    15 )    // vertex number 7


);

blocks
(
    // wing
    hex (  0  1  2  3  4  5  6  7 ) ( 60 16 30 )  simpleGrading ( 1 1 1 ) 
);

boundary
(
    left
    {
        type  symmetry;
        faces
        (
            (0 3 2 1)
        );
    }

    freestream
    {
        type patch;
        faces
        (

        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
