0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet (-208 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{

    left
    {
        type            symmetry;
    }
    freestream
    {
        type            freestream;
        freestreamValue uniform $Uinlet;
        value uniform   $Uinlet;
    }
    "wing.*"
    {
        type noSlip;        
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
