0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


pOut            1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField uniform $pOut;

boundaryField
{
    left
    {
        type            symmetry;
    }
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform $pOut;
    }
    "wing.*" 
    {
        type zeroGradient;      
    }

    #includeEtc "caseDicts/setConstraintTypes"

}


// ************************************************************************* //
