0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField uniform $Tinlet;

boundaryField
{
    left
    {
        type             symmetry;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }
    "wing.*"
    {
        type            zeroGradient;        
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
