0/alphat

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    left
    {
        type            symmetry;
    }
    freestream
    {
        type            calculated;
        value           uniform 0;
    }
    "wing.*"
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;     
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //