0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.01;

dimensions      [0 2 -2 0 0 0 0];

internalField uniform $kInlet;

boundaryField
{
    left
    {
        type            symmetry;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value uniform   $kInlet;
    }
    "wing.*" 
    {
        type  kqRWallFunction;
        value uniform $kInlet;      
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
